performance/browsePage.yml
config:
  target: "https://testing.v3.sit.ambitionone.com.au/"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Phase 1"
  processor: "./processor.ts"
  engines:
    playwright:
      showAllPageMetrics: true
      contextOptions:
        storageState: "storageState.json"

before:
  engine: playwright
  testFunction: loginUserAndSaveStorage

scenarios:
  # - name: "Playwright Test for Playwright Dev"
  #   engine: playwright
  #   testFunction: "playwrightTest"
  - name: "Fintell Test"
    engine: playwright
    testFunction: "fintellTest"